#include <stdio.h>

int main() {
    float a, b, c;
    char op;

    puts("=================================================");
    puts(" Програма обчислює значення арифметичного виразу ");
    puts("=================================================");
    puts(" Варiант 13. Можна використовувати операції: +, /");
    puts("=================================================");
    printf(" Введіть a: ");
    scanf("%f", &a);
    printf(" Введіть b: ");
    scanf("%f", &b);
    rewind(stdin);
    printf(" Введіть op: ");
    scanf("%c", &op);

    c = (op == '+') ? a + b : a / b;
    printf("\n %.6f %c %.6f = %.6f\n", a, op, b, c);

    return 0;
}